#pragma once
#include<iostream>
using namespace std;

void hello()
{

	cout << R"(

                 ___====-_  _-====___
           _--^^^#####//      \\#####^^^--_
        _-^##########// (    ) \\##########^-_
       -############//  |\^^/|  \\############-
     _/############//   (@::@)   \\############\_
    /#############((     \\//     ))#############\
   -###############\\    (oo)    //###############-
  -#################\\  / VV \  //#################-
 -###################\\/      \//###################-
_#/|##########/\######(   /\   )######/\##########|\#_
|/ |#/\#/\#/\/  \#/\##\  |  |  /##/\#/  \/\#/\#/\#| \|
`  |/  V  V  `   V  \#\| |  | |/#/  V   '  V  V  \|  '
   `   `  `      `   / | |  | | \   '      '  '   '
                    (  | |  | |  )
                   __\ | |  | | /__
                  (vvv(VVV)(VVV)vvv)

 )";
	cout << "----------------------------------------------------------------------------------------------------" << endl;
	cout << "ÏÐÈÂÅÒÑÒÓÞ ÂÀÑ ÏÎËÜÇÎÂÀÒÅËÜ ÂÛ ÂÎØËÈ Â ×ÀÒ!" << endl;
	cout << "Íàä ÷àòîì òðóäèëèñü:" << endl;
	cout << "Äàíèèë Êóëèêîâ - ñòàðøèé ñòàæ¸ð, ðàçðàáîò÷èê ìåõàíèçìà ÷àòà, êëàññîâ ìåññåäæ, è 2 ìåìîðè" << endl;
	cout << "Íèêîëàé Ëåâàíîâ - ñòàæ¸ð, ðàçðàáîò÷èê êëàññà þçåð, è áëîêà ðåãèñòðàöèè" << endl;
	cout << "Âëàäèñëàâ Êîëåñíè÷åíêî  -  ðàçðàáîò÷èê àñêåé äèçàéíà è ðàáîòà ñ öèêëàìè äëÿ ôóíêöèîíèðîâàíèÿ ÷àòà" << endl;
	cout << "----------------------------------------------------------------------------------------------------" << endl;
}